In [2]:
#Create Dataframes from excel, sql, list, set, map, tuples
import os
print(os.path)

<module 'ntpath' from 'C:\\Users\\pavan.sabinikari\\Anaconda3\\lib\\ntpath.py'>

In [9]:
#Create Dataframes from excel
import pandas as pd
#df = pd.read_csv("C:\\Users\\pavan.sabinikari\\Downloads\\TF_20210102_034_LF.CSV")
df = pd.read_csv("C:\\Users\\pavan.sabinikari\\Documents\\TF_20210102_034_LF_DD_WKT_MP.csv")
print(df['MP_ARRAY'].head(1))
df.dtypes

0    2.45,2.572,2.707,2.828,2.875,2.894,2.91,2.996,...
Name: MP_ARRAY, dtype: object

RT_ID              int64
RT_UNIQUE         object
BEGIN_MP         float64
END_MP           float64
D_BEGIN_MP       float64
D_END_MP         float64
MILES            float64
GOV_LEVEL          int64
D_GOV_LEVEL       object
RT_DESCR          object
DISTRICT           int64
D_DISTRICT        object
CNTY_NAME         object
COUNTY             int64
RT_PREFIX         object
D_RT_PREFIX       object
RT_NUMBER          int64
RT_SUFFIX         object
D_RT_SUFFIX      float64
RT_SECTION         int64
D_RT_SECTION      object
ITEM_ID            int64
INV_TYPE          object
START_DATE        object
MODIFY_DT         object
EXTRACT_DT        object
ADTSTATN          object
ADTSTYPE           int64
D_ADTSTYPE        object
BEGDESC           object
ENDDESC           object
LASTCNT          float64
LASTCNTYR        float64
ADTPRIOR         float64
ADTSRCE           object
D_ADTSRCE         object
ADTSINGLE        float64
ADTCOMBO         float64
PCSINGOP         float64
PCCOMBOP         float64
PCSINGPK         float64
PCCOMBPK         float64
GROWTH_FACTOR    float64
K_FACTOR         float64
D_FACTOR         float64
AXLE_FACTOR      float64
WKT               object
MP_ARRAY          object
dtype: object

In [ ]:
#filtering from df
df1=df[df["RT_ID"]==2468]
df1

In [ ]:
#Create Dataframes from sql
#df = pd.read_sql(conn,sql)

In [9]:
##Create Dataframes from list
import pandas as pd
lst = ['Geeks', 'For', 'Geeks', 'is','portal', 'for', 'Geeks']
#Below gives default index and columns
df_lst = pd.DataFrame(lst)
df_lst

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [10]:
#Providing columns and indexes
df_lst1 = pd.DataFrame(lst, columns =['Names'])
df_lst1

    Names
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [11]:
df_lst2 = pd.DataFrame(lst, index=['a', 'b', 'c', 'd', 'e', 'f', 'g'], columns =['Names'])
df_lst2

    Names
a   Geeks
b     For
c   Geeks
d      is
e  portal
f     for
g   Geeks

In [12]:
#Creating dataframe from two lists using zip.
# list of strings 
lst1 = ['Geeks', 'For', 'Geeks', 'is', 'portal', 'for', 'Geeks']

# list of int 
lst2 = [11, 22, 33, 44, 55, 66, 77]

df3 = pd.DataFrame(list(zip(lst1, lst2)), columns =['Name', 'val']) 
df3

     Name  val
0   Geeks   11
1     For   22
2   Geeks   33
3      is   44
4  portal   55
5     for   66
6   Geeks   77

In [13]:
# List of lists
lst5 = [['tom', 'reacher', 25], ['krish', 'pete', 30], 
       ['nick', 'wilson', 26], ['juli', 'williams', 22]] 
    
df = pd.DataFrame(lst5, columns =['FName', 'LName', 'Age'], dtype = float) 
df

   FName     LName   Age
0    tom   reacher  25.0
1  krish      pete  30.0
2   nick    wilson  26.0
3   juli  williams  22.0

In [15]:
# list of name, degree, score 
nme = ["aparna", "pankaj", "sudhir", "Geeku"] 
deg = ["MBA", "BCA", "M.Tech", "MBA"] 
scr = [90, 40, 80, 98] 
  
# dictionary of lists  
dict = {'name': nme, 'degree': deg, 'score': scr}

#Create dataframe
df_dict = pd.DataFrame(dict)
df_dict

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [17]:
#Dataframe to lists
df_dict_to_lst = df_dict.tolist()
df_dict_to_lst
#Melt, Concat, Merge, join, append,crosstab
#decorators, Python closures.

SyntaxError: invalid syntax (<ipython-input-17-5ee27628e963>, line 2)